# Параметризация для тестов FAQ
FAQ_TEST_DATA = [
    (0, ["Сутки", "400", "рублей"]),
    (1, ["пока", "заказ", "один", "самокат", "друзьями"]),
    (2, ["допустим", "заказ", "мая", "привозим"]),
    (3, ["завтрашнего", "дня", "расторопнее"]),
    (4, ["пока", "нет", "поддержку", "1010"]),
    (5, ["самокат", "зарядкой", "восемь", "суток", "передышек"]),
    (6, ["пока", "самокат", "не", "привезли"]),
    (7, ["обязательно", "самокатов", "москве", "области"])
]

# Параметризация для тестов заказа самоката
ORDER_TEST_DATA = [
    {
        "first_name": "Иван",
        "last_name": "Иванов",
        "address": "Москва, ул. Тверская, д. 1",
        "metro": "Сокольники",
        "phone": "89604715879",
        "date": "25.09.2025",
        "rental_period": "сутки",
        "color": "чёрный жемчуг",
        "comment": "Позвонить за час до доставки"
    },
    {
        "first_name": "Петр",
        "last_name": "Петров",
        "address": "Санкт-Петербург, Невский проспект, д. 10",
        "metro": "Черкизовская",
        "phone": "89604715880",
        "date": "26.09.2025",
        "rental_period": "двое суток",
        "color": "серая безысходность",
        "comment": "Оставить у подъезда"
    }
]
